RJIO_NE/NEreqXML.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.soap.in10s.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:instantNotification>
         <!--Optional:-->
         <APIKey>APP10088</APIKey>
         <!--Optional:-->
         <secretKey>123456</secretKey>
         <applicationId>10088</applicationId>
         <!--Optional:-->
         <transactionId>NA057</transactionId>
         <!--Optional:-->
         <senderId>abc</senderId>
         <!--Optional:-->
         <emailSenderId>EN65765</emailSenderId>
         <!--Optional:-->
         <SmsSenderId>?</SmsSenderId>
         <!--Optional:-->
         <rtssSenderId>?</rtssSenderId>
         <useNETemplate>true</useNETemplate>
         <!--Optional:-->
         <neTemplateDetails>
            <!--Optional:-->
            <context>1993JU</context>
         </neTemplateDetails>
         <!--Optional:-->
         <subject>sample mail</subject>
         <!--Optional:-->
         <message/>
         <numGroups>?</numGroups>
         <!--Optional:-->
         <groupDetailsArray>?</groupDetailsArray>
         <numRecipients>2</numRecipients>
         <!--Optional:-->
         <recipientDetailsArray>
            <!--Zero or  repetitions:-->
            <item>
               <!--Optional:-->
               <emailId>venkatesh.v@intense.in</emailId>
               <BCC>?</BCC>
               <CC>?</CC>
            </item>
            <item>
               <!--Optional:-->
               <RTSSCUSTID>RJIO</RTSSCUSTID>
               <!--Optional:-->
               <mobileNumber>8989564514</mobileNumber>
            </item>
         </recipientDetailsArray>
         <!--Optional:-->
         <updateStatusOnURL>?</updateStatusOnURL>
         <numnameValuePairs>1</numnameValuePairs>
         <!--Optional:-->
         <nameValuePairsArray>
            <!--Zero or more repetitions:-->
            <item>
               <name>AMOUNT</name>
               <value>5011</value>
            </item>
            <item>
               <name>ATM</name>
               <value>MISC</value>
            </item>
            <item>
               <name>BRANCH</name>
               <value>SBI</value>
            </item>
         </nameValuePairsArray>
      </ser:instantNotification>
   </soapenv:Body>
</soapenv:Envelope>